# ls_config

# токен сообщества для работы с ботом
token = 'b10473878154549000180f5a65525c710ad21ceb455a85429e448aab520076dd187a9abf7247959ece3fa'

# id группы
group_id = '186189504'

# ссылка на встроеную рассылку от вконтакте
notifications = "https://vk.com/app5748831_-186189504"  # это приложение вк

city = "severodvinsk"

welcome_text = "Добро пожаловать!❤ \nПодпишись для получения уведомлений \n https://vk.com/app5748831_-186189504"

start_text = ", приятного пользования😎\n\nP.S что бы посмотреть на список команд напишите 'функционал'"


functional = "Вот наш функционал: \n\n☁Погода \n\n📋Изменения в расписании \n    ●  Изменения на сегодня \n    " \
             "●  Изменения на завтра\n\n📌Важные даты \n    ●  ☀Таймер до летних каникул\n    " \
             "●  ⏰Таймер до ближайших каникул\n\n📰Новости школы\n\n⚠Особое\n    ●  🦠Коронавирус\n    " \
             "●  🃏Карточки\n    ●  🎲Учить/Не учить\n\n🏫О школе\n\n⚙Настройки\n    ●  🗿Standart режим клавиатуры\n" \
             "    ●  👑PRO режим клавиатуры\n\nP.S Что бы получать новости от сообщеста напишите 'Новости'"

school_information = "Муниципальное бюджетное общеобразовательное учреждение «Северодвинская гимназия №14» \n\n " \
                     "Директор - Гришкова Елена Ивановна \n\nАдрес: г. Северодвинск, ул. Торцева, 59 \n\nКонтактный " \
                     "телефон - 8184569838 \n\nАдрес электронной почты – gym14@mail.ru \n\nРаботаем с 1963 года!" \
                     "\n\nБольше информации об образовательном учреждении можно посмотреть на официальном сайте"

shedule_tomorrow_True_text_if_there_is = "Вот изменения на завтра"
shedule_tomorrow_True_text_if_not = "Изменений в расписании на завтра нет или их еще не объявили🤷‍♂"

shedule_tomorrow_False_text_if_there_is = "Вот изменения на сегодня"
shedule_tomorrow_False_text_if_not = "Изменений в расписании на сегодня нет или их еще не объявили🤷‍♂"


# осение каникулы
beginning_autumn_holidays_month = 11  # начало осених каникул(месяц)
beginning_autumn_holidays_day = 5  # начало осених каникул(день)
end_autumn_holidays_month = 11  # конец осених каникул(месяц)
end_autumn_holidays_day = 10  # конец осених каникул(день)

# летние каникулы
beginning_summer_holidays_month = 6  # начало летних каникул(месяц)
beginning_summer_holidays_day = 1  # начало летних каникул(день)
end_summer_holidays_month = 8  # конец летних каникул(месяц)
end_summer_holidays_day = 31  # конец летних каникул(день)

# весенние каникулы
beginning_spring_holidays_month = 3  # начало весенних каникул(месяц)
beginning_spring_holidays_day = 23  # начало весенних каникул(день)
end_spring_holidays_month = 3  # конец весенних каникул(месяц)
end_spring_holidays_day = 28  # конец весенних каникул(день)

# зимние каникулы
beginning_winter_holidays_month = 12  # начало зимних каникул(месяц)
beginning_winter_holidays_day = 30  # начало зимних каникул(день)
end_winter_holidays_month = 1  # конец зимних каникул(месяц)
end_winter_holidays_day = 11  # конец зимних каникул(день)

