import random
def visilnica():
    words_animals = ["аист", "акула", "бабуин", "баран", "барсук", "бобр", "бык", "варан", "верблюд", "волк", "вомбат", "воробей", "ворон", "выдра",
    "голубь", "гусь", "додо", "дятел", "енот", "ехидна", "еж", "жаба", "жираф", "журавль", "заяц", "зебра", "землеройка", "зяблик",
    "игуана", "кабан", "казуар", "кайман", "какаду", "кальмар", "камбала", "канарейка", "каракатица", "карп", "кенгуру",
    "киви", "кит", "лама", "ламантин", "ласка", "ласточка", "лебедь", "лев", "лемур", "ленивец", "леопард", "лиса", "лягушка",
    "мотылек", "муравьед", "муравей", "мангуст", "медведь", "морж", "муха", "мышь", "медуза", "нарвал", "носорог", "орел", "омар", "олень", "овцебык",
    "осьминог", "орел", "осел", "оса", "овца", "опоссум", "обезьяна", "паук", "пескарь", "пингвин", "пиранья", "попугай",
    "пчела", "рысь", "рыба", "росомаха", "страус", "сурок", "стрекоза", "сорока", "сова", "снегирь", "сокол", "собака", "слон",
    "слон", "скорпион", "скворец", "скат", "сельдь", "свинья", "сурикат", "скунс", "слизень", "светлячок", "тюлень", "тукан", "тигр",
    "трясогуска", "термит", "тетерев", "тунец", "тритон", "тарантул", "таракан", "тля", "утконос", "уж", "устрица", "улитка", "угорь", "фазан", "фламинго",
    "форель", "хорек", "хомяк", "хамелеон", "цапля", "цесарка", "цикада", "черепаха", "червь", "чайка", "шимпанзе", "шиншилла",
    "щука", "эму", "ящерица", "ястреб", "як", "ягуар"]

    word = random.choice(words_animals)
    print(word)

    len_word = len(word)

    health = 10

    used_letters=""

    win_word=[]

    letter_in_word = False

    # заполнение массива для слова в игре
    for i in range(len(word)):
        win_word+="_"
    
    while len_word != 0 and health != 0:
        
        # ввод буквы и проверка на повтор
        while True:

            letter = input("\nвведите букву ")
            
            letter = letter.lower()

            if len(letter) > 1:
                print("\nНе больше одного символа, попробуйте снова!")

            elif letter in used_letters:
                print("\nВы уже использовали эту букву")

            else:
                used_letters+=letter
                break
        
        count = 0

        for i in word:
            if letter in i:

                len_word -= 1
                letter_in_word = True
                win_word[count] = letter

            count += 1
    
        
        if letter_in_word is True:
            print(win_word)
        else:
            health -= 1  
            print(win_word)
    
        print("\nВаше здоровье = ", health)
    
    if len_word == 0:
        print("\nВы выиграли!!! \nВерным словом было: "+ word.upper())
    if health == 0:
        print("\nВы проиграли! \nВерным словом: "+ word.upper())

